
&НаКлиенте
Процедура НовоеЗадание(Команда)
	ОткрытьФорму("Обработка.РаботаСТестами.Форма.ФормированиеЗаданий",,ЭтаФорма,,,,
					Новый ОписаниеОповещения("НовоеЗаданиеЗавершение", ЭтаФорма), 
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НовоеЗаданиеЗавершение(Парам1, Парам2) Экспорт 

	ОбновитьСписки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьТестирование(Команда)
	ТестированиеПриложенийКлиент.ЗапуститьВсеТесты();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписки();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки()
	Элементы.Алгоритмы.Обновить();
	Элементы.Задания.Обновить();	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьРезультатыНаСервере(ВыделенныеСтроки)
	           
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРезультаты(Команда)
	ОчиститьРезультатыНаСервере(1); 
КонецПроцедуры
