
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоСеансов = 1;
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмыТестированияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.АлгоритмыТестирования.ТекущиеДанные.Количество = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	Если ЗначениеЗаполнено(ИнформационнаяБаза) И АлгоритмыТестирования.Количество() > 0 Тогда
		СоздатьЗаданияНаСервере();
		АлгоритмыТестирования.Очистить();
	Иначе
		Сообщить("Нужно заполнить информационную базу и выбрать алгоритмы");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаданияНаСервере()
	
	НачатьТранзакцию();
	
	ТекПорт = ТестированиеПриложенийСервер.СвободныйПорт();
	
	Для СчетчикСеансов = 1 по КоличествоСеансов цикл
	
		УИД = Строка(Новый УникальныйИдентификатор);
		
		МенеджерЗадания = РегистрыСведений.ЗаданияТестирования.СоздатьМенеджерЗаписи();
		МенеджерЗадания.ИнформационнаяБаза = ИнформационнаяБаза;
		МенеджерЗадания.УИД = УИД;
		МенеджерЗадания.Порт = ТекПорт;
		МенеджерЗадания.Записать();
		
		НаборЗаписейАлгоритмов = РегистрыСведений.СоставЗаданийТестирования.СоздатьНаборЗаписей();
		НаборЗаписейАлгоритмов.Отбор.УИД.Установить(УИД);
		НаборЗаписейАлгоритмов.Прочитать();
		
		СчетчикПорядка = 1;
		Для Каждого ТекАлгоритм из АлгоритмыТестирования цикл
			НовыйАлгоритм = НаборЗаписейАлгоритмов.Добавить();
			НовыйАлгоритм.УИД = УИД;
			НовыйАлгоритм.Порядок = СчетчикПорядка;
			НовыйАлгоритм.АлгоритмТестирования = ТекАлгоритм.Алгоритм;
			НовыйАлгоритм.Количество = ТекАлгоритм.Количество;
			СчетчикПорядка = СчетчикПорядка + 1;
		КонецЦикла;
		
		НаборЗаписейАлгоритмов.Записать();
		ТекПорт = ТекПорт + 1;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере()
	АлгоритмыТестирования.Загрузить(Шаблон.Алгоритмы.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	ЗаполнитьПоШаблонуНаСервере();
КонецПроцедуры
